// https://zh.wikipedia.org/wiki/%E7%BB%9D%E5%8F%A5

const words = {
  'A': {
    '1': {
      '-': ['东', '屋', '冬', '江', '支', '微', '佳', '灰', '蒸', '庚', '歌', '春', '中', '花', '依', '鱼', '齐', '寒', '阳', '合', '麻', '文', '真', '来', '云', '人', '年', '何', '桥'],
      '+': ['董', '讲', '纸', '尾', '语', '巧', '雪', '感', '送', '宋', '沃', '绛', '未', '御', '遇', '泰', '卦', '队', '物', '问', '艳', '啸'],
    },
    '2': {
      '-': ['东风', '黄昏', '平生', '人间', '十分', '匆匆', '黄花', '春风', '一声', '西风', '一枝', '相思', '谁知', '不知', '长安', '东君', '而今', '梅花', '风吹', '悠悠', '桃花', '青山', '扁舟', '如今', '阑干', '神仙', '时节', '当年', '天涯', '凄凉', '风流', '相逢', '蓬莱', '尊前', '功名', '行人', '佳人', '归来', '江南', '断肠', '西湖', '多情', '故人', '当时', '十年', '何时', '去年', '无人', '少年', '斜阳', '海棠', '年年', '无情', '芙蓉', '月明', ],
      '+': ['桃李', '芳草', '一点', '风雨', '流水', '杨柳', '千里', '回首', '多少', '一曲', '惟有', '万里', '一笑', '深处', '一片', '不是', '时候', '何处', '肠断', '富贵', '春色', '心事', '归去', '昨夜', '今夜', '无限', '今日', '不似', '依旧', '不见', '江上', '天上', '风月', '几度', '明月', '往事', '寂寞', '憔悴', '天气', '何事', ],
    }
  },
  'B': {
    '1': [{
      '-': ['东', '空', '松', '通', '庸', '宫', '宗', '荣', '同', '浓'],
      '+': ['涌', '耸', '哄', '拢', '总', '统', '送', '痛', '用', '动', '纵', '弄'],
    }],
  },
}
module.exports.words = words

const templates = [
  ['A2-/A2+/B1-/，', 'A2+/A2-/B1-/。', 'A2+/A2-/B1+/，', 'A2-/A2+/B1-/。', ],
]
module.exports.templates = templates
